In [1]:
p1 = {"name" : "ruffy", "age" : 17}
p2 = {"name" : "zoro", "age" : 19}
print(p1)
print(p2)

{'name': 'ruffy', 'age': 17}
{'name': 'zoro', 'age': 19}

In [9]:
# 사용자가 새로 만든 데이터 타입 -> 클래스
class Pirate:
    def __init__(self, name = "", age = 0): # 메서드(생성자 메서드) : 클래스 안에 있는 함수
        self.name = name
        self.age = age
p3 = Pirate("ruppy", 17) # class 함수 앞에 있는 걔 self
# p3.name = "ruppy"
# p3.age = 17

In [23]:
data = []
p = Pirate("루피", 17)
data.append(p)
data.append(Pirate("조로", 20))
data.append(Pirate("나미", 19))
data.append(Pirate("상디", 19))
data.append(Pirate("우솦", 18))
print(len(data))

5

In [15]:
for i in range(len(data)):
    print(data[i].name, data[i].age)

루피 17
조로 20
나미 19
상디 19
우솦 18

In [16]:
for i in range(len(data)):
    if (data[i].age >= 19):
        print(data[i].name, data[i].age)

조로 20
나미 19
상디 19

In [17]:
for i in range(len(data)):
    if ("루" in data[i].name):
        print(data[i].name, data[i].age)

루피 17

In [19]:
for i in range(len(data)):
    if (data[i].name == "루피"):
        data[i].age = 16
        print(data[i].name, data[i].age)

루피 16

In [29]:
for i in range(len(data)):
    if (data[i].name == "우솦"):
        data.remove(data[i])

for i in range(len(data)):
    print(data[i].name, data[i].age)

루피 17
조로 20
나미 19
상디 19

In [41]:
name_list = []
age_list = []
for i in range(len(data)):
    name_list.append(data[i].name)
    age_list.append(data[i].age)
print(name_list)
print(age_list)

import pandas as pd
df = pd.DataFrame({"이름" : name_list, "나이" : age_list})
df

['루피', '조로', '나미', '상디']
[17, 20, 19, 19]

   이름  나이
0  루피  17
1  조로  20
2  나미  19
3  상디  19

In [6]:
import pandas as pd
import MySQLdb
conn = MySQLdb.connect(host = "localhost", port = 3306, db = "employees", user = "root", password = "python1234")
print(conn)
cursor = conn.cursor()
cursor.execute("select dept_no, dept_name from departments order by dept_no")
rows = cursor.fetchall()
print(rows)
no_list = []
name_list = []
for row in rows:
    no_list.append(row[0])
    name_list.append(row[1])
print(no_list)
print(name_list)
dept = pd.DataFrame({"dept_no" : no_list, "dept_name" : name_list})
dept

<_mysql.connection open to 'localhost' at 000001FD743B3488>
(('d001', 'Marketing'), ('d002', 'Finance'), ('d003', 'Human Resources'), ('d004', 'Production'), ('d005', 'Development'), ('d006', 'Quality Management'), ('d007', 'Sales'), ('d008', 'Research'), ('d009', 'Customer Service'))
['d001', 'd002', 'd003', 'd004', 'd005', 'd006', 'd007', 'd008', 'd009']
['Marketing', 'Finance', 'Human Resources', 'Production', 'Development', 'Quality Management', 'Sales', 'Research', 'Customer Service']

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service